# ------------------------------------查询操作-------------------------------
# 获取单个元素
# t=(1,2,3,4,5)
# print(t[-1])

# 获取多个元素
# ------------------------------------切片操作-------------------------------
# print(t[0:3])
# ------------------------------------反转操作-------------------------------
# print(t[::-1])
# print(t[4:1:-1]) #(5,4,3)

# ------------------------------------获取操作-------------------------------
# tuple.count(item) 统计元祖中指定元素的个数
# tuple.index(item) 获取元祖中指定元素的索引
# len(tup) 返回元祖中元素个数
# max(tup) 返回元祖中元素最大的值
# min(tup) 返回元祖中元素最小的值
t=(1,2,3,2,4)
# c=t.count(12) #元素不存在则输出0
# print(c)
#
# idx=t.index(13) #元素不存在则报错
# print(idx)
length=len(t)
print(length)

maxNum=max(t)
minNum=min(t)
print(maxNum,minNum)

# 判定
# 元素 in元祖
# 元素 not in元祖
print(11 in t)

# 比较
# >,<,==
result=(4,2)>(1,2)#True
print(result)